Autodesk.Revit.DB.Structure.RebarTerminationOrientation
Orientation of a rebar termination (e.g hook, crank) relative to the path of the Rebar Shape.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Structure.RebarTerminationOrientation.Right
Hook or crank towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the
exterior of an arc-based shape (RebarShapeDefinitionByArc).

Autodesk.Revit.DB.Structure.RebarTerminationOrientation.Left
Hook or crank towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the
interior of an arc-based shape (RebarShapeDefinitionByArc).